IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/GPIOC_1.0.xml
    <register id="GPIOC_POLARITY15_0" width="32" offset="0x1390" description="Polarity 15 to 0">
        <bitfield id="DIO0" description="Enables and configures edge detection polarity for DIO0." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO1" description="Enables and configures edge detection polarity for DIO1." begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO2" description="Enables and configures edge detection polarity for DIO2." begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO3" description="Enables and configures edge detection polarity for DIO3." begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO4" description="Enables and configures edge detection polarity for DIO4." begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO5" description="Enables and configures edge detection polarity for DIO5." begin="11" end="10" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO6" description="Enables and configures edge detection polarity for DIO6." begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO7" description="Enables and configures edge detection polarity for DIO7." begin="15" end="14" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO8" description="Enables and configures edge detection polarity for DIO8." begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO9" description="Enables and configures edge detection polarity for DIO9." begin="19" end="18" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO10" description="Enables and configures edge detection polarity for DIO10." begin="21" end="20" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO11" description="Enables and configures edge detection polarity for DIO11." begin="23" end="22" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO12" description="Enables and configures edge detection polarity for DIO12." begin="25" end="24" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO13" description="Enables and configures edge detection polarity for DIO13." begin="27" end="26" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO14" description="Enables and configures edge detection polarity for DIO14." begin="29" end="28" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO15" description="Enables and configures edge detection polarity for DIO15." begin="31" end="30" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
    </register>
    <register id="GPIOC_POLARITY31_16" width="32" offset="0x13A0" description="Polarity 31 to 16">
        <bitfield id="DIO16" description="Enables and configures edge detection polarity for DIO16." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO17" description="Enables and configures edge detection polarity for DIO17." begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO18" description="Enables and configures edge detection polarity for DIO18." begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO19" description="Enables and configures edge detection polarity for DIO19." begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO20" description="Enables and configures edge detection polarity for DIO20." begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO21" description="Enables and configures edge detection polarity for DIO21." begin="11" end="10" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO22" description="Enables and configures edge detection polarity for DIO22." begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO23" description="Enables and configures edge detection polarity for DIO23." begin="15" end="14" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO24" description="Enables and configures edge detection polarity for DIO24." begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO25" description="Enables and configures edge detection polarity for DIO25." begin="19" end="18" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO26" description="Enables and configures edge detection polarity for DIO26." begin="21" end="20" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO27" description="Enables and configures edge detection polarity for DIO27." begin="23" end="22" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO28" description="Enables and configures edge detection polarity for DIO28." begin="25" end="24" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO29" description="Enables and configures edge detection polarity for DIO29." begin="27" end="26" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO30" description="Enables and configures edge detection polarity for DIO30." begin="29" end="28" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="DIO31" description="Enables and configures edge detection polarity for DIO31." begin="31" end="30" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="RISE_FALL" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
    </register>
